ChalmersUniversiy/16_implementPassiveScalarTransportSolver/tests/passiveScalarCavity/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    // volScalarFieldValue alpha.water 0
    volScalarFieldValue s 0
);

regions
(
    boxToCell
    {
        // box (0 0 -1) (0.1461 0.292 1);
        // fieldValues
        // (
        //     volScalarFieldValue alpha.water 1
        // );
        box (0.03 0.03 -1) (0.06 0.06 1);
        fieldValues
        (
            volScalarFieldValue s 1

        );
    }
);


// ************************************************************************* //
